In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
# http://pandas.pydata.org/pandas-docs/stable/merging.html

In [49]:
df1 = DataFrame({'key': [ '여자', '여자', '남자', '외계인', '남자', '남자', '여자'],
                'data1': range(7),
                },
               )
df1

   data1  key
0      0   여자
1      1   여자
2      2   남자
3      3  외계인
4      4   남자
5      5   남자
6      6   여자

In [50]:
df2 = DataFrame({'key': ['남자', '여자', '신'],
                'data2': range(3)})
df2

   data2 key
0      0  남자
1      1  여자
2      2   신

In [51]:
pd.merge(df1,df2)

   data1 key  data2
0      0  여자      1
1      1  여자      1
2      6  여자      1
3      2  남자      0
4      4  남자      0
5      5  남자      0

In [52]:
pd.merge(df1,df2, on='key')

   data1 key  data2
0      0  여자      1
1      1  여자      1
2      6  여자      1
3      2  남자      0
4      4  남자      0
5      5  남자      0

In [53]:
df3 = DataFrame({'rkey': ['남자','여자','행성'],
                'data2': range(3)})
df3

   data2 rkey
0      0   남자
1      1   여자
2      2   행성

In [54]:
pd.merge(df1,df3, left_on='key', right_on='rkey')

   data1 key  data2 rkey
0      0  여자      1   여자
1      1  여자      1   여자
2      6  여자      1   여자
3      2  남자      0   남자
4      4  남자      0   남자
5      5  남자      0   남자

In [55]:
pd.merge(df1,df3, left_on='key', right_on='rkey', how='outer')

   data1  key  data2 rkey
0      0   여자      1   여자
1      1   여자      1   여자
2      6   여자      1   여자
3      2   남자      0   남자
4      4   남자      0   남자
5      5   남자      0   남자
6      3  외계인    NaN  NaN
7    NaN  NaN      2   행성

In [56]:
pd.concat([df1,df2])

   data1  data2  key
0      0    NaN   여자
1      1    NaN   여자
2      2    NaN   남자
3      3    NaN  외계인
4      4    NaN   남자
5      5    NaN   남자
6      6    NaN   여자
0    NaN      0   남자
1    NaN      1   여자
2    NaN      2    신

In [57]:
pd.concat([df1,df2], axis=1)

   data1  key  data2  key
0      0   여자      0   남자
1      1   여자      1   여자
2      2   남자      2    신
3      3  외계인    NaN  NaN
4      4   남자    NaN  NaN
5      5   남자    NaN  NaN
6      6   여자    NaN  NaN

In [58]:
df1.join(df3)

   data1  key  data2 rkey
0      0   여자      0   남자
1      1   여자      1   여자
2      2   남자      2   행성
3      3  외계인    NaN  NaN
4      4   남자    NaN  NaN
5      5   남자    NaN  NaN
6      6   여자    NaN  NaN

In [59]:
df3.index = df3.rkey
df3

      data2 rkey
rkey
남자        0   남자
여자        1   여자
행성        2   행성

In [60]:
df1.join(df3, on='key')

   data1  key  data2 rkey
0      0   여자      1   여자
1      1   여자      1   여자
2      2   남자      0   남자
3      3  외계인    NaN  NaN
4      4   남자      0   남자
5      5   남자      0   남자
6      6   여자      1   여자

# stack, unstack

In [20]:
data = DataFrame(np.arange(6).reshape((2,3)), 
                index=pd.Index(['Ohio', 'Colorado'], name='state'),
                columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [21]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [22]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [23]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [24]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [25]:
result.unstack('number')

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [26]:
# pivot

In [62]:
df5 = df1.copy()
df5['value1'] = np.random.randn(len(df5))
df5['value2'] = np.random.randn(len(df5))
df5

   data1  key    value1    value2
0      0   여자 -0.554899 -1.110456
1      1   여자  0.003704 -0.323599
2      2   남자 -1.681924  1.245971
3      3  외계인 -1.158495  0.507316
4      4   남자 -0.170055  1.549899
5      5   남자 -1.401982 -0.991961
6      6   여자  0.393042 -0.057404

In [64]:
# pivot(index, columns, values(optional))
df5.pivot('key','data1','value1')

data1         0         1         2         3         4         5         6
key
남자          NaN       NaN -1.681924       NaN -0.170055 -1.401982       NaN
여자    -0.554899  0.003704       NaN       NaN       NaN       NaN  0.393042
외계인         NaN       NaN       NaN -1.158495       NaN       NaN       NaN

In [65]:
df5.pivot('key','data1','value2')

data1         0         1         2         3         4         5         6
key
남자          NaN       NaN  1.245971       NaN  1.549899 -0.991961       NaN
여자    -1.110456 -0.323599       NaN       NaN       NaN       NaN -0.057404
외계인         NaN       NaN       NaN  0.507316       NaN       NaN       NaN

In [29]:
df5.pivot('key','data1')

         value1                                                           \
data1         0         1         2        3         4        5        6
key
a           NaN       NaN  1.320441      NaN -0.867499  1.00893      NaN
b     -0.468543 -0.474783       NaN      NaN       NaN      NaN -0.51963
c           NaN       NaN       NaN -1.06492       NaN      NaN      NaN

         value2
data1         0        1         2       3         4         5         6
key
a           NaN      NaN  0.239217     NaN -1.286515  0.227569       NaN
b      0.473655 -0.04148       NaN     NaN       NaN       NaN  3.352743
c           NaN      NaN       NaN  0.4966       NaN       NaN       NaN

In [30]:
# 중복제거

In [68]:
data3 = DataFrame({'k1': ['one'] *3 + ['two'] *4,
                  'k2': [ 1, 1, 2, 3, 3, 4, 4]})
data3

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [69]:
data3.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [70]:
data3.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [71]:
data3.drop_duplicates(['k1'])

    k1  k2
0  one   1
3  two   3

In [72]:
data3.drop_duplicates(['k2'])

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [35]:
# 값 변형

In [73]:
data3['k1up']=data3['k1'].map(str.upper)
data3

    k1  k2 k1up
0  one   1  ONE
1  one   1  ONE
2  one   2  ONE
3  two   3  TWO
4  two   3  TWO
5  two   4  TWO
6  two   4  TWO

In [74]:
data3.replace(1, 100)

    k1   k2 k1up
0  one  100  ONE
1  one  100  ONE
2  one    2  ONE
3  two    3  TWO
4  two    3  TWO
5  two    4  TWO
6  two    4  TWO

In [75]:
data3[np.abs(data3['k2']) > 3]

    k1  k2 k1up
5  two   4  TWO
6  two   4  TWO

In [39]:
# 임의 샘플링

In [40]:
# 문자열 다루기

In [41]:
val = 'a,b,  guido'

In [42]:
val.split(',')

['a', 'b', '  guido']

In [43]:
first,second,third = val.split(',')

In [44]:
first

'a'

In [45]:
'::'.join(val.split(','))

'a::b::  guido'

In [46]:
val.count(',')

2

In [47]:
val.replace(',', '::')

'a::b::  guido'

In [48]:
# 정규표현식

In [78]:
# 7.5 예제: 미국 농무부 음식 데이터베이스